1:WizQst1507A9
00000000

Let me take a look at this Tablet. Hmm. Something, something, something... there be Djinn. Ah, this is the section right here.
00000001

"To reach the true home of the Djinn, a Djinni must go home from home..." Well, what in the sands does that mean? Istar?
00000002

A Djinni must go home from home? That's one of those riddle things, isn't it, Master? I'm not very good at those. 
00000003

Then we are at an impasse... unless, perhaps the Pale Djinni would know the answer. Yes. Take the Tablet to Dumoozid.
00000004

I fear this business with the Djinn does not bode well, not at all. Let us hope Dumoozid can help us find out what is going on.
00000005

Oh, it's you again! For the love of all that's clean, please tell me you wiped your feet this time. I'm still decontaminating my tent, you know.
00000006

You're here about Eerkala, aren't you? I hear she organized some kind of conspiracy among the Djinn. As usual, I wasn't invited.
00000007

Count yourself lucky. I was tricked into helping them, but not anymore. We're going to Eerem Palace to put a stop to this madness.
00000008

That's why we came. We need your help getting to Eerem. This Tablet says the secret is to "go home from home." Any idea what that means?
00000009

You have the Eerem Tablet? I thought it was lost. What I wouldn't have given to know this secret a few centuries ago. Now, I'm over it.
00000010

To "go home from home," you say? Hmm. Yes. Of course! After all these years... to think, it's so obvious! It's a lamp within a lamp!
00000011

You mean... we take one Djinni lamp inside another Djinni lamp and go inside? Perfect! I keep my lamp with me these days. Can we use yours too?   
00000012

Oh dear, I don't know... I just finished dusting... oh, but all right, just this once. Go on in. Good luck.
00000013

Oh Master, it's so clean! If you saw the inside of my lamp, it's... wow. I'd be so embarrassed after this. 
00000014

All right. I'll put my lamp here. Know what? Just in case, I'm going to go in first so I can tidy up if it doesn't take us to Eerem.   
00000016

Istar's Lamp
00000017

Oh, thank the sands! After seeing the inside of his lamp, I realized how messy mine is. I'm just glad you didn't have to see it.
00000018

I can't believe I'm in Eerem Palace. In Djinni terms, this is as fancy as it gets. Oh Master, this is so exciting, isn't it?
00000022

Dumoozid's Lamp
